# -*- coding: utf-8 -*-
"""Savchenko.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1hd-zHgB7ALYOYYZjLc1th1bZRTc0qUQt
"""

import pandas as pd

df = pd.read_csv('survey_results_public.csv', low_memory=False, encoding='utf-8', on_bad_lines='skip')
schema = pd.read_csv('survey_results_schema.csv', encoding='utf-8')

df.head()

# Задание 1 — количество респондентов
total_respondents = len(df)

print("Total respondents:", total_respondents)

"""**Вывод:** В опросе приняли участие 40191 респондент. Это достаточно большой объём данных для проведения анализа."""

# Задание 2 — полный ответы

questions = set(schema['qname'])
columns = set(df.columns)

valid_columns = list(questions.intersection(columns))

full_answers = df[valid_columns].dropna(how='any')

print("Respondents with full answers:", len(full_answers))

"""**Вывод:** В датасете нет респондентов, которые ответили на все вопросы. Это связано с большим количеством вопросов и пропущенных значений."""

# Задание 3 — статистика WorkExp

work_exp = df['WorkExp'].dropna()

print("Mean:", work_exp.mean())
print("Median:", work_exp.median())
print("Mode:", work_exp.mode()[0])

"""**Вывод:** Средний опыт работы составляет около 13 лет, медианное и наиболее частое значение — 10 лет. Это говорит о том, что большинство респондентов имеют около 10 лет опыта."""

# Задание 4 — удалённая работа

df['RemoteWork'].value_counts()

remote_workers = df[df['RemoteWork'] == 'Remote'].copy()

print("Remote workers:", len(remote_workers))

"""**Вывод:** В датасете 10931 респондент работает полностью удалённо. Это показывает значительную долю специалистов, выбирающих remote формат работы."""

# Задание 5 — Python %

python_users = df['LanguageHaveWorkedWith'].str.contains('Python', na=False)

python_percent = round(python_users.mean() * 100, 2)

print("Python users:", python_percent, "%")

"""**Вывод:** Около 37.54% респондентов используют Python. Это подтверждает высокую популярность языка среди разработчиков."""

# Задание 6 — онлайн обучение

online_users = df['LearnCode'].str.contains('Online', case=False, na=False)

print("Users who learned online:", online_users.sum())

"""**Вывод:** 28352 респондента обучались программированию с помощью онлайн-курсов.
Это показывает, что онлайн-обучение является одним из самых популярных способов изучения программирования.
"""

# Задание 7 — Географический анализ зарплат Python-разработчиков

# фильтруем Python-разработчиков
python_dev = df[df['LanguageHaveWorkedWith'].str.contains('Python', na=False)]

# группируем по странам и считаем среднее и медиану
salary_stats = python_dev.groupby('Country')['ConvertedCompYearly'].agg(['mean', 'median'])

# убираем пропуски
salary_stats = salary_stats.dropna()

# округляем и сортируем
salary_stats = salary_stats.round(2).sort_values(by='mean', ascending=False)

salary_stats.head()

"""**Вывод:** Уровень заработной платы Python-разработчиков значительно отличается в зависимости от страны. В некоторых странах наблюдается большой разрыв между средним и медианным значением, что может указывать на неравномерное распределение доходов."""

# Задание 8 — топ 5 по зарплате

salary_df = df[['ConvertedCompYearly', 'EdLevel']].dropna(subset=['ConvertedCompYearly'])

top5_education = salary_df.sort_values(by='ConvertedCompYearly', ascending=False).head(5)

top5_education

"""**Вывод:** Среди самых высокооплачиваемых респондентов встречаются как бакалавры,
так и специалисты с магистерским образованием. Это показывает, что высокий доход возможен при разных уровнях образования.
"""

# Задание 9 — Анализ популярности Python по возрастным группам

# создаём копию DataFrame (чтобы избежать SettingWithCopyWarning)
df_copy = df[['Age', 'LanguageHaveWorkedWith']].copy()

# создаём столбец с признаком использования Python
df_copy['UsesPython'] = df_copy['LanguageHaveWorkedWith'].str.contains('Python', na=False)

# группируем по возрасту и считаем процент
python_by_age = df_copy.groupby('Age')['UsesPython'].mean() * 100

# округляем значения
python_by_age = python_by_age.round(2)

python_by_age

"""**Вывод:** Python наиболее популярен среди молодых специалистов (18–24 года), где его используют около 40% респондентов. С увеличением возраста популярность Python постепенно снижается."""

# Задание 10 — индустрии топ-remote

# считаем 75 перцентиль
threshold = df['ConvertedCompYearly'].quantile(0.75)

# фильтруем: зарплата выше порога + удалёнка
filtered = df[
    (df['ConvertedCompYearly'] > threshold) &
    (df['RemoteWork'] == 'Remote')
]

# убираем пропуски в индустрии
filtered = filtered.dropna(subset=['Industry'])

# считаем популярные индустрии
top_industries = filtered['Industry'].value_counts()

top_industries

"""**Вывод:** Среди высокооплачиваемых удалённых специалистов наиболее популярной индустрией является Software Development. Также значительную долю занимают Fintech и Healthcare. Это показывает, что IT-сфера остаётся лидером по уровню доходов среди remote специалистов."""